##############################
# OOP - Formative 1
# Reid A. Martin
##############################


class Person:
    
    def __init__(self, name, dumb_level):
        self.name = name
        self.dumb_level = dumb_level
        
    def desc(self):
        print (f"{self.name} is on the {self.dumb_level}th plane of stupidity.")
    
    def sound(self, noise):
        print(f"{self.name} says {noise}")
    
######################   
reid = Person("Reid", "420")
graden = Person("Graden", "69")

######################
reid.desc()

graden.desc()

reid.sound("*̵͔̺̃̏̄̓͐̿͑͂́̈́̃̈́̽̽́͋̽̇͋̓̽͆͗̏̔́̄̾͂̈͋̑̏͌͆͆͐́̅̋̋̀͛͋̅̏͘͘̚͠͠*̴̧͚͇̲͙̭̹̪͔̮͈̲͉͙̤̹̘̓̆̄̆̊̔̍͊̌͒͋́̆̆̑͋͂̅̈́̾͑̓͂̀̓̊̄̈̐̋̀̈́̈́͂̈́̎́͆̇̈́̂̌͋̉̌̚͘͜͠͝͝ͅį̴̡̢̡̧̨̢̡͕̜̪͙̝̤̣̣͚͎̬̯̪̫͎̟͉̟̼̦̖̼̙͙̪͙̝͚̲̗̲̮͕̘̩͊̇̃̆̃̐̐͑̾̓́̈̀̽̓̔̏͗͊̀̉́͆̅̑̂͂̊͗̓̉͊̕͘͘̚͘͘͜͜͜͜͜͠ͅͅņ̷̧̛̛̛̛̼͇͓̣̱͓̥̲̟͈̮͔̣̗̭̥̥͎̹̙̣̹͔̘͍̤͔̭̝͈̫͚̝͔̖̜͖̼̟͉̭̬̙͕͉͔̭͗̏̈́͋̂̂̎͛͒́̍̓̓̀͌͐͌̏̃̾͛̈̂͌̓̃̏̍̍̉̂̈̽͜͜ͅc̸̨̢̡̢͈̲̹͉̭͓̲͈͔̣̪̯̠͚̩͎̰̻͚̟̮͇͓͓͎͎̉̒̓̓̓̌̒̿̈̊ơ̷̟̞̺̝̰͉̯̳̼̬̞͓̹̑̑̌͊̒̇̎̐̊̅͗̒͐͆̊̌̂͂̿͊͛̈́̋̀̀́̍̌̽͐̃͋̏̂̑̐̃̍͘͝͝ͅḿ̵̧͚̖̝͕̙̙̺͚̙͈̜̫̮͈͍̟͚͍̠̯͍̼̫̥͐̍͑̀̽͋͒̐̀͐̀͜͠͝ͅͅͅͅp̴̨̧̛̻͇̱̠͓̞̩̰̮͖̖̥̥̖͓̥͗͛̋̿̄̑̇͑̃̈́͆͗̌̃͒͋̊͗̏͂̽͊͗̃̈́̋̍̊̀̇͌̾̿͝͝ȑ̸̢̫͕̫͕̯͎͎̦̝͌̆͊́̅̀͆̀̈͘͝ȩ̸̢̨̺̯̜̬͈͓͎͈̞̠̣̮̦̣̱̙͔̬̰͉̠͙̱͙͖̜̙̥̥̳̳͓͉̮̬̥̞͚̰̬̭̗͖̜̗̗̦͈̅́̈̂̒̔̔͋͌͂̾̄͒͆̈́͗͋̋̌̑̇͐̅̏̇̃̾̀̈́͘̕̚͜h̸̡̛̝͖͇̓͆͒̓̑̈́̈́̑̆̿̏̇̅̅͂͛͂͛̓͂̽̚̕͘͜͠͝ė̷͖̹̭̺̬̗̥̝̍̾̈́̈́̆͋̐̾̍̋͑̔̅̌͌͋͐̈́̑̌̀̓̃͒́͘̕̚̕̕ñ̸̨̡̧̛͔̰͙͈͎̻̮̯̃͒̂́͒̈́̅͒̒͗̅̔̍͊̔́̌̂͆͒̈́͂̓͑́͆̈́̎͛͒͋͒̋̓͗̕̚̚ͅs̵̢̨̨̬̙̰̣̭̗̜̣̰̦̫͎̬̭͉̤̣͖͑̏̀̀͜ǎ̶̢̟͎̻̥̣̱̪̫̟͇̥̀̑̋̾͒̀ͅb̸̨̢̢̠̞͔̝̞̝͍̪͚̩̰͓͙̹̺̜͎̝̫͚͖͔̞̪̪̳͍̝̫̐́̿̑̀̓̑̏̓́̿̍͊̇̇̔̅̿̓̽̑͆̐̄̽̆̈̆͐͂͜͜͝͝͝ĺ̴̨̧̡̛̗̹͕̲͉̣̺͚̦̘̰͉̤̦̹̯̥̠̟̩̯̪̺̰͚̬̰̯͖̗̆̉̅̅̅̓̑̅̀́͐̑̀̆̍̓̏̉̅͊̈́̇̀̿̓̏͘̕̕̕͝͠ͅͅḙ̴̢̨̨̡̰̳̥̞̻̲͔̤͚̩̖͔̰͍̰͕̜̖̩̦̮̘͕̼͚̗͍͙͚̫̗̲̤̹̩̼͖͙̲̈́̉͊̾̎̓́̌͆̈́̀̊̍̄̆͑͘̕͜͝ ̴̨̡̧̧̢̡̡̛̗͓̹͔͍̹̞̝͓̜͈̜̲̤͕̠̖͍͓͕̪̰͍̙͔̫̝̥͔̞̟̰̥̥͚̬͚̦͚̜͐̄͊͗͗̓͂͜n̴̨̧̢͉̜̩͓̤͔͙̘̥̱͇̭̪̥̘̻̯̺̥̤͂̑̏̿̌̈́ṍ̷̡̡̢̬̞̱̣̩͍͙̩̣̖̯̘̞̣͈͔̙̭̜͇͖͉̻͓̝̦̻̤̺̫͉̽̃͐́̚ͅͅį̴̨̢͎͖̳͍̙̞̲̩̦̗͇̜̮̻͈̰̬͖̤͔̥̲̙̻̲̺̖̙̩͎̻͍̝̳͕̺̪̺͚̽̀̐̀͆̕͜͝ͅͅş̵̡̢̧̛̪̟̠̟̩̭͈̼̦̖͉̭̹͈̮̬̮͍̯̥̻̗͎͚̪̘̊͂͗̍̄̊̿̍̽̑͌̌̿̔̂̈́̉̓̄̏̓̈͗͛̉̀̐̍̇͑̓̀̈̋́͗̆̏͘̚͜͝͝e̸̢̡̧̢̧̜͚͉͕̩͇̥̦̟͈̜͉̳̥͉͕̭̫͔̹̙͚̣̣͈̮̦̪̤̱̝̻̿͜s̵̛͔̜̪͙̒́̍̏̏̈́̀͋̈́̋̀̈́̈́̈́̍͋̈̈́͗̋̈́̕͘͜͠͝*̶̛̩̻̤͕̠͔̰̼̮̹̭̰̅̍͐͗͂͋̅̐̂͗̈̀͐̓̃́̅̅̍͒̐̓̅͂͌̓̒͋̄̏̎́̕̕͘͝͠*̸̡̡̛̛̥̳̩̠̯̺̲̥͙̗͉̜̼̠͇̳̪͙̞̯̙̌́̀̈́͋͋́̎̀͠͝")

graden.sound("woof")